import threadImage from "./assets/threadImage.jpeg";

const mock = [
  {
    id: 1,
    room: { title: "104003 - חדו״א 1", roomId: 1 },
    votes: 20,
    details: {
      by: "TGIF1996",
      time: 4,
      title: "לא בטוח שהבנתי את ההוכחה של גבול…",
      body:
        "הסבירו לנו בהרצאה היום על הוכחת הגבול, אבל לא ממש הבנתי מה אני אמור להוכיח ומה הקטע עם האפסילון והדלתא. יש מצב לעזרה?",
    },
  },
  {
    id: 2,
    room: { title: "096411 - למידה חישובית 1", roomId: 2 },
    votes: 30,
    details: {
      by: "SixColors1984",
      time: 15,
      title: "פורום שאלות-תשובות לתרגיל בית 1 - הגשה ב-14.5.2020",
      body:
        "היי כולם, מוזמנים לשאול כאן שאלות ולהגיב תשובות, הצעות לעזרה וכל תוכן מועיל לגבי תרגיל בית 1. מזכירה לכולם את חוקי החדר. הגשה מוצלחת לכולם 😊",
    },
  },
  {
    id: 3,
    room: { title: "למידת מכונה - ML", roomId: 3 },
    votes: 10,
    details: {
      by: "Tsahi-Cohen",
      time: 12,
      title: "המלצה על מודלים לזיהוי כלבים בתמונות?",
      body:
        "מחפש מודלים לזיהוי כלבים בתמונות, ספציפית פודלים. חיפשתי קצת בגוגל ולא מצאתי משהו ספציפי. אני עובד על איזה פרויקט בעבודה ולרוב העובדים יש כלבים (לבוסית יש פודל…). תודה!",
    },
  },
  {
    id: 4,
    room: { title: "234111 - מבוא למדעי המחשב", roomId: 4 },
    votes: 25,
    details: {
      by: "PM_Me_Potatoes",
      time: 5,
      title: "מדריך להתקנת CodeBlocks",
      body:
        "היי כולם, למי שקצת הסתבך ואולי לא הצליח להתקין כמו שצריך כתבתי מדריך יותר נוח איך להתקין CodeBlocks ואיך מתמודדים עם שגיאות התקנה וכו׳. בהצלחה! קובץ מצורף.",
    },
  },
  {
    id: 5,
    room: { title: "095140 - תכנון פרויקטים וניהולם", roomId: 5 },
    votes: 20,
    details: {
      by: "HelenOfTROY",
      time: 2,
      title: "דף נוסחאות מוקלד",
      body: "מצרפת דף נוסחאות מוקלד, תודה ל-KittyKat על העזרה!",
      image: threadImage,
    },
  },
  {
    id: 6,
    room: { title: "095140 - תכנון פרויקטים וניהולם", roomId: 5 },
    votes: 150,
    details: {
      by: "someGuy",
      time: 1,
      title: "תרגיל בית 5",
      body: "מחפש פתרון לתרגיל בית 5",
    },
  },
];

export default mock;
